<a href="https://colab.research.google.com/github/HusanJalilov/AI_Jpyuter_/blob/main/pandas/pandas_datafream_2_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
import pandas as pd
data={
    "ranglar":[122,33,44,12,45,776,224],
    "Turlari":[22,12,45,75,35,77,111]
}

In [8]:
df=pd.DataFrame(data)

In [9]:
df

   ranglar  Turlari
0      122       22
1       33       12
2       44       45
3       12       75
4       45       35
5      776       77
6      224      111

In [11]:
df.head(2)

   ranglar  Turlari
0      122       22
1       33       12

In [15]:
df.loc[1:2]

   ranglar  Turlari
1       33       12
2       44       45

In [16]:
df.loc

In [36]:
data1={
    "Oquv yili":[2018,2019,2020,2021,2022,2023,2024,2025],
    "Talabalar":[120,300,1000,1243,1132,2000,1239,2050],
    "imtiyozliklar":[20,12,44,56,32,45,64,65]
}

In [37]:
data1=pd.DataFrame(data1)
data1

   Oquv yili  Talabalar  imtiyozliklar
0       2018        120             20
1       2019        300             12
2       2020       1000             44
3       2021       1243             56
4       2022       1132             32
5       2023       2000             45
6       2024       1239             64
7       2025       2050             65

In [45]:
 data2=pd.DataFrame(data1,columns=['Talabalar','Oquv yili','Imtiyozliklar','Kirolmaganlar'],index=('a','b','s','d','e','f','g','h'))
 data2

   Talabalar  Oquv yili  Imtiyozliklar  Kirolmaganlar
a        NaN        NaN            NaN            NaN
b        NaN        NaN            NaN            NaN
s        NaN        NaN            NaN            NaN
d        NaN        NaN            NaN            NaN
e        NaN        NaN            NaN            NaN
f        NaN        NaN            NaN            NaN
g        NaN        NaN            NaN            NaN
h        NaN        NaN            NaN            NaN

In [25]:
data1.Talabalar

a   NaN
b   NaN
s   NaN
d   NaN
e   NaN
f   NaN
g   NaN
h   NaN
Name: Talabalar, dtype: float64

In [40]:
data1

   Oquv yili  Talabalar  imtiyozliklar
0       2018        120             20
1       2019        300             12
2       2020       1000             44
3       2021       1243             56
4       2022       1132             32
5       2023       2000             45
6       2024       1239             64
7       2025       2050             65

In [43]:
data2

0